# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
import pandas as pd
import functions

df1_cleaned= pd.read_csv('D:/IronHack/Data_Analytics/Week_1/Day_3/Afternoon/lab-dw-data-cleaning-and-formatting/file1_clean.csv')
df1_cleaned.head()

df2= pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv')
df3= pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv')

df2_cleaned= functions.clean_insurance_company_dataframe(df2)
df3_cleaned= functions.clean_insurance_company_dataframe(df3)


display(df2_cleaned.isnull().sum())

#the gender column has 5 missing values, which is only 0.5% of the data, so i will drop these rows
#the customer lifetime value also has only 4 missing values, so i will drop these rows too

display(df2_cleaned[(df2_cleaned['gender'].isnull())])
display(df2_cleaned[(df2_cleaned['customer_lifetime_value'].isnull())])

df2_cleaned = df2_cleaned.dropna(subset=['customer_lifetime_value'])  #dropping null values in customer lifetimme value column
df2_cleaned = df2_cleaned.dropna(subset=['gender']) #dropping nulll values in gender column

display(df2_cleaned.isnull().sum()) #no more null values in the dataframe

display(df2_cleaned.info())
df2_cleaned= functions.all_num_to_int(df2_cleaned) #calling the all_num_to_int function as the customer_lifetime_value column had NaNs and was therefore not converted to int
df2_cleaned.info() # now we have 5 integer columns, the same applies for the other 2 dataframes


dfcombined= pd.concat([df1_cleaned, df2_cleaned, df3_cleaned], axis=0)
display(dfcombined.info()) #checking that there are no null values
display(dfcombined.duplicated().sum()) #checking the duplicated rows. found 44 rows that need to be removed
dfcombined_cleaned= functions.clean_insurance_company_dataframe(dfcombined) #cleaned the combined dataframe again
dfcombined_cleaned.duplicated().sum() #checking if all duplicates have been removed. They have been removed

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
167,DH41343,Washington,NaN,College,2444.0,92834,61,0,293,Special Auto,Four-Door Car
228,AO98601,Washington,NaN,Bachelor,5019.0,54500,63,0,302,Corporate Auto,Two-Door Car
257,XR95069,Washington,NaN,Bachelor,4855.0,29834,6464,0,307,Personal Auto,Four-Door Car
372,HF88410,Washington,NaN,High School or Below,NaN,36765,66,1,321,Personal Auto,Four-Door Car
980,SV62436,Washington,NaN,Bachelor,3042.0,13789,79,0,379,Personal Auto,Four-Door Car

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
325,RI52095,Washington,M,High School or Below,NaN,51878,66,1,317,Personal Auto,Four-Door Car
372,HF88410,Washington,NaN,High School or Below,NaN,36765,66,1,321,Personal Auto,Four-Door Car
580,MW80236,Washington,M,Master,NaN,0,70,0,336,Personal Auto,Four-Door Car
861,TO60700,Washington,F,Bachelor,NaN,25859,74,0,355,Special Auto,Four-Door Car

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

<class 'pandas.core.frame.DataFrame'>
Index: 988 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   988 non-null    object
 1   state                      988 non-null    object
 2   gender                     988 non-null    object
 3   education                  988 non-null    object
 4   customer_lifetime_value    988 non-null    float64
 5   income                     988 non-null    int64
 6   monthly_premium_auto       988 non-null    int64
 7   number_of_open_complaints  988 non-null    int64
 8   total_claim_amount         988 non-null    int64
 9   policy_type                988 non-null    object
 10  vehicle_class              988 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 92.6+ KB

None

<class 'pandas.core.frame.DataFrame'>
Index: 988 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   988 non-null    object
 1   state                      988 non-null    object
 2   gender                     988 non-null    object
 3   education                  988 non-null    object
 4   customer_lifetime_value    988 non-null    int64
 5   income                     988 non-null    int64
 6   monthly_premium_auto       988 non-null    int64
 7   number_of_open_complaints  988 non-null    int64
 8   total_claim_amount         988 non-null    int64
 9   policy_type                988 non-null    object
 10  vehicle_class              988 non-null    object
dtypes: int64(5), object(6)
memory usage: 92.6+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 9126 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9126 non-null   object
 1   state                      9126 non-null   object
 2   gender                     9126 non-null   object
 3   education                  9126 non-null   object
 4   customer_lifetime_value    9126 non-null   int64
 5   income                     9126 non-null   int64
 6   monthly_premium_auto       9126 non-null   int64
 7   number_of_open_complaints  9126 non-null   int64
 8   policy_type                9126 non-null   object
 9   vehicle_class              9126 non-null   object
 10  total_claim_amount         9126 non-null   int64
dtypes: int64(5), object(6)
memory usage: 855.6+ KB

None

44

0

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [2]:
marketing_df= pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv')

for i in marketing_df.columns: 
    display(marketing_df[i].value_counts())  #displaying the value counts for each column to check if anything needs to be cleaned

marketing_df= marketing_df.drop(columns=['unnamed:_0'])  #dropping the unnamed column
display(marketing_df.duplicated().sum()) #checking  for duplicated values
marketing_df= functions.remove_full_nulls(marketing_df) #removing nan rows
marketing_df= functions.duplicate_checking(marketing_df)  #removing duplicated rows
display(marketing_df.duplicated().sum())  #there are no remaining duplicates

unnamed:_0
0        1
7276     1
7268     1
7269     1
7270     1
        ..
3638     1
3639     1
3640     1
3641     1
10909    1
Name: count, Length: 10910, dtype: int64

customer
ID89933    7
DQ50258    5
AM79057    5
FP86246    5
KE35335    4
          ..
VW27730    1
ZX64745    1
CK24264    1
IX18485    1
WA60547    1
Name: count, Length: 9134, dtype: int64

state
California    4183
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
Name: count, dtype: int64

customer_lifetime_value
7507.455372     11
5504.139033     11
5181.620895     10
13727.799720    10
5332.462694     10
                ..
3467.323976      1
14140.558850     1
20018.204590     1
7432.299921      1
11971.977650     1
Name: count, Length: 8041, dtype: int64

response
No     9444
Yes    1466
Name: count, dtype: int64

coverage
Basic       6660
Extended    3265
Premium      985
Name: count, dtype: int64

education
Bachelor                3272
College                 3204
High School or Below    3146
Master                   887
Doctor                   401
Name: count, dtype: int64

effective_to_date
2011-01-10    239
2011-01-27    239
2011-01-31    224
2011-01-17    221
2011-02-14    221
2011-01-26    220
2011-01-03    216
2011-01-19    212
2011-02-27    205
2011-01-28    203
2011-02-26    202
2011-01-20    201
2011-01-21    199
2011-02-04    198
2011-02-07    197
2011-02-19    196
2011-02-03    195
2011-01-11    195
2011-01-05    193
2011-02-28    192
2011-02-22    191
2011-01-02    191
2011-02-18    186
2011-02-10    186
2011-02-11    184
2011-01-23    184
2011-02-12    183
2011-01-18    183
2011-02-25    183
2011-01-08    182
2011-01-29    182
2011-01-09    182
2011-02-05    181
2011-02-01    181
2011-02-02    181
2011-02-09    180
2011-01-14    180
2011-01-24    179
2011-02-21    178
2011-01-07    178
2011-02-23    176
2011-01-30    173
2011-01-15    172
2011-01-16    172
2011-01-13    171
2011-01-01    171
2011-02-06    171
2011-01-25    168
2011-02-13    168
2011-02-16    167
2011-02-24    162
2011-02-17    162
2011-01-06    161
2011-02-20    156
2011-02-15    155
2011-02-08    155
2011-01-22    148
2011-01-12    148
2011-01-04    131
Name: count, dtype: int64

employmentstatus
Employed         6789
Unemployed       2787
Medical Leave     504
Disabled          499
Retired           331
Name: count, dtype: int64

gender
F    5573
M    5337
Name: count, dtype: int64

income
0        2787
95697      15
60920      11
68931      10
11432      10
         ...
45310       1
88055       1
74606       1
88043       1
64195       1
Name: count, Length: 5694, dtype: int64

location_code
Suburban    6902
Rural       2116
Urban       1892
Name: count, dtype: int64

marital_status
Married     6319
Single      2958
Divorced    1633
Name: count, dtype: int64

monthly_premium_auto
65     419
66     371
71     368
73     363
63     345
      ...
163      1
178      1
287      1
228      1
203      1
Name: count, Length: 202, dtype: int64

months_since_last_claim
15.149071    633
3.000000     426
6.000000     394
1.000000     386
7.000000     378
4.000000     373
2.000000     368
5.000000     355
0.000000     354
10.000000    346
16.000000    333
11.000000    331
15.000000    323
13.000000    320
8.000000     315
12.000000    307
17.000000    299
14.000000    299
9.000000     277
19.000000    276
23.000000    276
25.000000    269
21.000000    267
18.000000    257
20.000000    254
22.000000    246
24.000000    237
29.000000    234
28.000000    227
31.000000    221
26.000000    211
27.000000    208
30.000000    201
34.000000    199
33.000000    198
35.000000    157
32.000000    155
Name: count, dtype: int64

months_since_policy_inception
59    168
61    151
50    151
10    138
3     136
     ...
16     81
96     80
82     71
98     64
97     59
Name: count, Length: 100, dtype: int64

number_of_open_complaints
0.000000    8160
1.000000    1145
0.384256     633
2.000000     414
3.000000     324
4.000000     166
5.000000      68
Name: count, dtype: int64

number_of_policies
1    3864
2    2748
3    1380
7     532
9     505
5     498
4     488
8     461
6     434
Name: count, dtype: int64

policy_type
Personal Auto     8128
Corporate Auto    2341
Special Auto       441
Name: count, dtype: int64

policy
Personal L3     4118
Personal L2     2537
Personal L1     1473
Corporate L3    1221
Corporate L2     688
Corporate L1     432
Special L2       193
Special L3       170
Special L1        78
Name: count, dtype: int64

renew_offer_type
Offer1    4483
Offer2    3490
Offer3    1732
Offer4    1205
Name: count, dtype: int64

sales_channel
Agent          4121
Branch         3022
Call Center    2141
Web            1626
Name: count, dtype: int64

total_claim_amount
316.800000    139
292.800000    136
312.000000    132
350.400000    129
331.200000    119
             ...
137.168874      1
487.345606      1
45.152521       1
402.749918      1
618.288849      1
Name: count, Length: 5106, dtype: int64

vehicle_class
Four-Door Car    5834
Two-Door Car     2118
SUV              2012
Sports Car        550
Luxury SUV        208
Luxury Car        188
Name: count, dtype: int64

vehicle_size
Medsize    7873
Small      1966
Large      1071
Name: count, dtype: int64

vehicle_type
A    10910
Name: count, dtype: int64

month
1    5818
2    5092
Name: count, dtype: int64

443

0

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [8]:
piv= marketing_df.pivot_table(index=['sales_channel'], values= ['customer_lifetime_value'], aggfunc=['sum'])
piv=piv.reset_index()
piv.columns=['Sales channel', 'Total Revenue']
piv['Total Revenue']= piv['Total Revenue'].round(2)
display(piv)

#It appears that the sales channel brought the most sales in terms of total revenue



piv2= marketing_df.pivot_table(index=['gender', 'education'], values=['customer_lifetime_value'], aggfunc =['mean'])
piv2=piv2.reset_index()
display(piv2)

  Sales channel  Total Revenue
0         Agent    31822870.96
1        Branch    23545858.75
2   Call Center    16550431.05
3           Web    12118527.39

  gender             education                    mean
                               customer_lifetime_value
0      F              Bachelor             7913.452862
1      F               College             7755.029922
2      F                Doctor             7369.591923
3      F  High School or Below             8616.664839
4      F                Master             8226.362324
5      M              Bachelor             7713.303475
6      M               College             8086.291367
7      M                Doctor             7414.859039
8      M  High School or Below             8162.364059
9      M                Master             8154.605652

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [4]:
piv3= marketing_df.pivot_table(index=['policy_type' , 'month'], values=['number_of_open_complaints'], aggfunc = ['count'])
piv3=piv3.reset_index()
verticalized = pd.melt(piv3,id_vars=['policy_type','month'])
display(verticalized)

      policy_type  month variable_0                 variable_1  value
0  Corporate Auto      1      count  number_of_open_complaints   1197
1  Corporate Auto      2      count  number_of_open_complaints   1044
2   Personal Auto      1      count  number_of_open_complaints   4166
3   Personal Auto      2      count  number_of_open_complaints   3638
4    Special Auto      1      count  number_of_open_complaints    227
5    Special Auto      2      count  number_of_open_complaints    195